<%@ page language="java" pageEncoding="UTF-8"%>
<%@ page contentType="text/html; charset=UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>
<%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt"%>
<%@ taglib prefix="fn" uri="http://java.sun.com/jsp/jstl/functions"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<script src="http://code.jquery.com/jquery-latest.min.js"
	type="text/javascript"></script>
<script type="text/javascript" src="js/jquery-2.2.0.min.js"></script>
<script type="text/javascript" src="js/jquery.quickflip.js"></script>
<link rel="stylesheet" type="text/css" href="./styles.css" />
<title>Επιχειρησιακή Στρατηγική</title>
</head>
<body>
	<div id="menu">
		<c:if test="${role == 'employee'}">
			<ul>
				<li><a href="homeEmployee.jsp" accesskey="1">Αρχική Σελίδα
				</a></li>
				<li class='active has-sub'><a href='company.jsp'>Η Εταιρία</a>
					<ul>
						<li class='has-sub'><a href='company.jsp'>Προβολή
								στοιχείων</a>
							<ul>
								<li><a id="link" href='businessStrategy.jsp'>Επιχειρησιακή
										Στρατηγική</a></li>
							</ul></li>
						<li class='active'><a href='businessInfo.jsp'>Πληροφορίες</a></li>
					</ul></li>
				<li><a href='employeesTabbed-employeeMode.jsp'>Εργαζόμενοι</a></li>
				<li><a href='goals.jsp'>Στόχοι</a></li>
				<li class='has-sub'><a href='employeeProfile.jsp'>Προφίλ
						${username}</a>
					<ul>
						<li><a href='evaluationsEmployeeMode.jsp'>Αξιολογήσεις</a></li>
						<li><a href='changePassword.jsp'>Αλλαγή Κωδικού</a></li>
						<li><a href='logout.jsp'>Αποσύνδεση</a></li>
					</ul></li>
			</ul>
		</c:if>
		<c:if test="${role == 'manager'}">
			<ul>
				<li><a href="homeManager.jsp">Αρχική Σελίδα </a></li>
				<li class='active has-sub'><a href='company.jsp'>Η Εταιρία</a>
					<ul>
						<li class='has-sub'><a href='company.jsp'>Προβολή
								στοιχείων</a>
							<ul>
								<li><a href='businessStrategy.jsp'>Επιχειρησιακή
										Στρατηγική</a></li>
							</ul></li>
						<li class='active'><a href='businessInfo.jsp'>Πληροφορίες</a></li>
					</ul></li>
				<li><a href='employeesTabbed.jsp'>Εργαζόμένοι</a></li>
				<li><a href='goalsTabbed.jsp'>Στόχοι</a></li>
				<li class='has-sub'><a href='managerProfile.jsp'>Προφίλ
						${username}</a>
					<ul>
						<li><a href='changePassword.jsp'>Αλλαγή Κωδικού</a></li>
						<li><a href='logout.jsp'>Αποσύνδεση</a></li>
					</ul></li>
			</ul>
		</c:if>
	</div>
	<div id="header" align="center">
		<h3>Οδηγίες σχεδιασμού στόχων</h3>
	</div>
	<p>
		<strong>Ορισμός Σχεδιασμού:</strong> Η διαδικασία μέσω της οποίας οι
		μάνατζερ καθορίζουν τους στόχους της επιχείρησης και τους τρόπους που
		θα χρησιμοποιήσουν για να τους επιτύχουν
	</p>

	<strong>Πλεονεκτήματα Σχεδιασμού στόχων</strong>
	<br> Ο Σχεδιασμός προσδιορίζει που βρίσκεται η επιχείρηση τώρα και
	που θα βρίσκεται στο μέλλον.
	<ul>
		<li>Μειώνει την αβεβαιότητα, που υπάρχει μελλοντικά, για την
			επιχείρηση</li>
		<li>Αίσθηση Συμμετοχής: όλοι οι μάνατζερ εμπλέκονται στην επιλογή
			στόχων</li>
		<li>Δίνει μια σαφή εικόνα της κατεύθυνσης προς την οποία βαδίζει
			η επιχείρηση</li>
		<li>Συντονισμός: Εξηγεί πώς τα συστήματα όλων των μερών της
			επιχείρησης εναρμονίζονται με το σύνολο</li>
		<li>Διευκολύνει τον έλεγχο της επιχειρησιακής δραστηριότητας,
			Προσδιορίζει δηλαδή ποιοι είναι υπεύθυνοι για την επίτευξη ενός
			στόχου</li>
		<li>Μειώνει το κόστος λειτουργίας της επιχείρησης.</li>
	</ul>

	<strong>Διαδικασία του σχεδιασμού</strong>
	<ul>
		<li>Καθορισμός αποστολής</li>
		<li>Προσδιορισμός σημερινής θέσης της επιχείρησης (Ανάλυση
			Εσωτερικού & Εξωτερικού Περιβάλλοντος)</li>
		<li>Καθορισμός στόχων</li>
		<li>Διαμόρφωση εναλλακτικών στρατηγικών</li>
		<li>Αξιολόγηση & επιλογή εναλλακτικών στρατηγικών</li>
		<li>Κατάρτιση προγραμμάτων δράσης & προϋπολογισμών Εφαρμογή
			προγραμμάτων δράσης</li>
		<li>Αναπληροφόρηση</li>
		<li>Έλεγχο</li>
	</ul>


		<strong>Διαδικασία ανάπτυξης στόχων</strong> Μέρος της λειτουργίας του
		προγραμματισμού είναι η δήλωση των επιχειρηματικών σκοπών και στόχων
		ως επιμέρους βήματα / υπό-στόχους που θα πρέπει να επιτευχθούν ώστε να
		εκπληρωθεί ο αρχικός στόχος. 
			<p>Αυτοί οι στόχοι θα πρέπει να συμφωνούν με
		την όλη στρατηγική της επιχείρησης που είναι αναγραμμένη σε αρχείο και
		να διατυπώνει την στρατηγική και το όραμα της. Η διαδικασία ανάπτυξης
		στόχων και των απαραίτητων βημάτων θα πρέπει να έχει ως αρχικό και
		τελικό στόχο την επίτευξη στρατηγικής της. Οι στόχοι δε χρειάζεται να
		είναι υπερβολικά περίπλοκοι αλλά είναι αναγκαίο να είναι αρκετά
		λεπτομερείς για την επίτευξη των επιθυμητών αποτελεσμάτων. Για την
		καταγραφή αποτελεσματικών στόχων αρχικά θα πρέπει να γίνεται συζήτηση
		ανάμεσα στα αρμόδια άτομα, τα οποία θα τους αναπτύξουν. Τα ερωτήματα
		που βοηθούν στην καταγραφή αυτών των στόχων είναι: ποιος/οι είναι οι
		αρμόδιοι που θα πραγματοποιήσουν τους στόχους, τι θα επιτύχουν, ποτέ
		και πως θα υλοποιηθεί ένας στόχος. Το πιο ευρέως διαδεδομένο και
		χρησιμοποιούμενο πρότυπο για την δημιουργία στόχων είναι το <strong>S.M.A.R.T.</strong>
		(<strong>S</strong>pecific: Συγκεκριμένοι, <strong>M</strong>easurable: Μετρήσιμοι, <strong>A</strong>ttainable: Εφικτοί,
		<strong>R</strong>elevant: Σχετικοί, <strong>T</strong>ime-bound: Χρονικά ορισμένοι) δηλαδή:
	<ul>
		<li>Συγκεκριμένοι: Οι στόχοι πρέπει να έχουν ξεκάθαρο περιεχόμενο
			ώστε να προσδιορίζουν με σαφήνεια το τι προσδοκείτε ακριβώς από τον
			υπάλληλο να επιτύχει. Με αυτόν τον τρόπο, οι μάνατζερς μπορούν εύκολα
			να μετρούν την εξέλιξη του εκάστοτε εργαζομένου στα πλαίσια της
			εκπλήρωσης στόχου.</li>
		<li>Μετρήσιμοι: Περιλαμβάνει ορόσημα για την παρακολούθηση
			εξέλιξης και υποκινεί τους εργαζομένους στην επίτευξη των σκοπών.
			Επίσης, ότι μπορεί να μετρηθεί έχει την πιθανότητα να βελτιωθεί.</li>
		<li>Εφικτοί: Το επίπεδο δυσκολίας για την κατόρθωση στόχων θα
			πρέπει να αναφέρεται σε μέσο εργαζόμενο, ούτε σε υψηλότερο ούτε σε
			χαμηλότερο.</li>
		<li>Σχετικοί: Θα πρέπει να εστιάζουν σε μέγιστη επίδραση στην
			συνολική στρατηγική της επιχείρησης</li>
		<li>Χρονικά ορισμένοι: Θα πρέπει να καθοριστεί αρκετός χρόνος για
			την επίτευξη του στόχου, αλλά όχι υπερβολικά πολύς ώστε να
			υπονομεύσουν την ολική επίδοση της επιχείρησης. Οι στόχοι που δεν
			οριοθετούνται χρονικά τείνουν να παραβλέπονται μέρα με τη μέρα.</li>
	</ul>


</body>
</html>