<%@ page language="java" pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<script src="js/scriptMenu.js"></script>
</head>
<body>
	<br>
	<div id="header" align="center" style="font-size: large;">
		Καλως ήρθατε <font style="text-transform: capitalize;">
			${username}</font>, στο πληροφοριακό σύστημα "Παρακολούθησης Στόχων και
		Αξιολόγησης Εργαζομένων".
	</div>
	<p>Το πληροφοριακό αυτό σύστημα, σας διευκολύνει στον τομέα
		παρακολούθησης στρατηγικής της επιχείρησης σας μέσω της παρακολούθησης
		στόχων. Ακόμα, σας διευκολύνει στον τομέα αξιολόγησης και συλλογής
		στοιχείων για την απόδοση των εργαζομένων ανάλογα με κάποιους
		συγκεκριμένους παράγοντες, στους οποίους βαθμολογούνται.</p>
	<br>
	<div id="header">
		<h3 align="center">Managers</h3>
	</div>
	<p>Η εφαρμογή αυτή περιλαμβάνει λειτουργίες με τις οποίες μπορούν
		οι managers, να προβάλλουν στοιχεία των εργαζομένων της εταιρίας και
		να αξιολογούν τους υφισταμένους τους μέσω του στοιχείου του menu
		"Εργαζομένοι".</p>
	<p>Ακόμα, μπορούν να αναθέτουν στόχους στους υπαλλήλους τους, να
		τους παρακολουθούν βλέποντας ποιοι στόχοι έχουν ολοκληρωθεί. Αυτές οι
		λειτουργίες διαθέτονται μέσω του στοιχείου του menu "Στόχοι".</p>

	<div id="header">
		<h3 align="center">Εργαζόμενοι</h3>
	</div>
	<p>Οι εργαζόμενοι από την άλλη μπορούν να προβάλλουν στοιχεία του
		manager τους και αξιολογήσεις που έχουν γίνει για τους ίδιους από τους
		προϊσταμένους τους μέσω του προφίλ τους.</p>
	<p>Επιπλέον, έχουν τη δυνατότητα να προβάλλουν τους στόχους που
		τους έχουν ανατεθεί και ολοκληρώνοντας τους θα τους προστίθεται στο
		εισοδημά τους το αντίστοιχο bonus που έχει ορισθεί από τον manager
		τους.</p>

	<div id="header">
		<h3 align="center">Admin</h3>
	</div>
	<p>Ο διαχειριστής του συστήματος διαθέτει τη δυνατότητα να
		προβάλλει τις νέες εγγραφές των εργαζομένων ή μάνατζερ στο σύστημα
		μέσω του στοιχείου menu "Έγκριση/Απόρριψη Εγγραφών" και να επιλέξει
		ποιοι εργαζόμενοι θα μπορούν να χρησιμοποιούν το σύστημα ως
		εξουσιοδοτημένα εγγεγραμένα μέλη.</p>
	<p>Επίσης, έχει τη δυνατότητα να προβάλλει τους ενεργούς χρήστες
		του συστήματος μέσω του στοιχείου menu "Προβολή Ενεργών Εγγραφών". Από
		εκεί μπορεί να προβάλλει και να επεξεργαστεί τα στοιχεία των εργαζομένων και μάνατζερ
		που ήδη μπορούν να χρησιμοποιούν το σύστημα ως εξουσιοδοτημένα μέλη.</p>
</body>
</html>